#POSTTEST1
import library pandas

In [2]:
import pandas as pd

mengambil dataset dengan perintag pd.read_csv yang bernama salaries_cyber.csv

In [7]:
dataset = pd.read_csv("salaries_cyber.csv")

dataset.info(), merupakan perintah untuk mengambil dataset jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null

In [23]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1247 entries, 0 to 1246
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           1247 non-null   int64
 1   experience_level    1247 non-null   object
 2   employment_type     1247 non-null   object
 3   job_title           1247 non-null   object
 4   salary              1247 non-null   int64
 5   salary_currency     1247 non-null   object
 6   salary_in_usd       1247 non-null   int64
 7   employee_residence  1247 non-null   object
 8   remote_ratio        1247 non-null   int64
 9   company_location    1247 non-null   object
 10  company_size        1247 non-null   object
dtypes: int64(4), object(7)
memory usage: 107.3+ KB

memasukkan dictionary dengan key sesuai nama informasi

In [12]:
for index, item in enumerate(dataset):
    print(f"{index}. {item}")

0. work_year
1. experience_level
2. employment_type
3. job_title
4. salary
5. salary_currency
6. salary_in_usd
7. employee_residence
8. remote_ratio
9. company_location
10. company_size

perintah dataset.describe(), untuk menampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka

In [4]:
dataset.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  1247.000000  1.247000e+03    1247.000000   1247.000000
mean   2021.316760  5.608525e+05  120278.218925     71.491580
std       0.715501  1.415944e+07   70291.394942     39.346851
min    2020.000000  1.740000e+03    2000.000000      0.000000
25%    2021.000000  7.975450e+04   74594.500000     50.000000
50%    2021.000000  1.200000e+05  110000.000000    100.000000
75%    2022.000000  1.600800e+05  150000.000000    100.000000
max    2022.000000  5.000000e+08  910991.000000    100.000000

perintah dataset.corr(), untuk menampilkan nilai korelasi attribute bertipe angka

In [29]:
dataset.corr()

C:\Users\USER\AppData\Local\Temp\ipykernel_10192\2191645083.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  dataset.corr()

               work_year    salary  salary_in_usd  remote_ratio
work_year       1.000000  0.027042       0.184246      0.135720
salary          0.027042  1.000000      -0.033166      0.019112
salary_in_usd   0.184246 -0.033166       1.000000      0.174523
remote_ratio    0.135720  0.019112       0.174523      1.000000

dataset1 = dataset['salary']*0.001
dataset1.head(10)

untuk menampilkan dataset berupa attribute salary yang bertipe angka menjadi desimal 3 angka dibelakang koma

In [19]:
dataset1 = dataset['salary']*0.0001
print(dataset1)

0        6.300
1        9.500
2        7.000
3       25.000
4       12.000
         ...
1242    14.000
1243     6.000
1244    12.600
1245     4.200
1246     6.631
Name: salary, Length: 1247, dtype: float64

dataset[['work_year','salary','salary_in_usd','remote_ratio']].head(10)
untuk menampilkan 10 record pertama attribute yang bertipe angka

In [18]:
dataset[['work_year','salary','salary_in_usd','remote_ratio']].head(10)

   work_year  salary  salary_in_usd  remote_ratio
0       2022   63000          63000            50
1       2022   95000          95000             0
2       2022   70000          70000             0
3       2022  250000          48853            50
4       2022  120000         120000           100
5       2022  315000         315000           100
6       2022  220000         220000           100
7       2022  140000         140000           100
8       2021   55000          75650            50
9       2022  360000         360000           100

data = dataset[['work_year','salary','salary_in_usd','remote_ratio']].copy()
untuk mengambil dataset dengan attribute bertipe angka 

data.to_csv("salary_cyber_int.csv")
perintah untuk mengexport csv yang telah ditentukan atau di edit

In [13]:
data = dataset[['work_year','salary','salary_in_usd','remote_ratio']].copy()
data.to_csv("salary_cyber_int.csv")